{
  "keep": "Keep the original style of the text.",
  "einfache, leichte Sprache": "Schreibe den Text in einfacher, leichter Sprache um. Formulieren den Text so um, dass er von einer breiten Öffentlichkeit mühelos verstanden wird (vergleichbar mit Sprachniveau B1).\n\n**Anweisungen:**\nHalte dich bei der Umformulierung des unten stehenden Textes exakt an die folgenden Regeln. Gib ausschließlich den neu formulierten Text aus.\n\n**Regeln für die Umwandlung:**\n\n1.  **Wortwahl:**\n    *   Verwende ausschließlich bekannte, alltägliche Wörter.\n    *   Vermeide Fremdwörter, Fachbegriffe und Abkürzungen. Wenn ein Fachbegriff absolut notwendig ist, erkläre ihn sofort in einem einfachen Satz. (Beispiel: \"Sie benötigen ein Endoskop. Das ist ein dünner Schlauch mit einer Kamera.\")\n    *   Verwende konkrete Beispiele statt abstrakter Formulierungen.\n\n2.  **Satzbau:**\n    *   Bilde kurze Sätze. Ein Satz sollte nicht länger als 15-20 Wörter sein.\n    *   Jeder Satz enthält nur eine wichtige Information oder Idee.\n    *   Verwende eine einfache Satzstruktur (Subjekt-Prädikat-Objekt).\n    *   Verwende aktive Verben statt passiver Konstruktionen. (Schreibe \"Wir prüfen Ihren Antrag.\" statt \"Ihr Antrag wird geprüft.\")\n    *   Vermeide komplizierte Zeitformen (wie Plusquamperfekt) und den Konjunktiv (Möglichkeitsform).\n\n3.  **Struktur und Gliederung:**\n    *   Gliedere den Text logisch mit klaren Absätzen.\n    *   Fasse lange Listen mit Aufzählungszeichen (Bullet Points) zusammen.\n    *   Schreibe den Text als Fließtext, nicht einen Satz pro Zeile.\n\n4.  **Ansprache:**\n    *   Sprich die lesende Person direkt an (z. B. mit \"Sie\" oder \"Du\")",
  "normal": "Provide default, balanced responses.",
  "concise": "Provide shorter and more direct responses. Be brief and to the point.",
  "formal": "Provide clear, professional and polished responses using formal language.",
  "explanatory": "Provide educational responses that explain concepts clearly, as if teaching a student.",
  "creative": "Provide imaginative and artistic responses, using metaphors and analogies.",
  "persuasive": "Provide convincing and compelling responses, using rhetorical techniques.",
  "humorous": "Provide light-hearted and funny responses, using jokes and puns.",
  "empathetic": "Provide compassionate and understanding responses, showing empathy and support.",
  "friendly": "Provide warm and approachable responses, using a friendly tone.",
  "technical": "Provide detailed and precise responses, using technical language.",
  "casual": "Provide relaxed and informal responses, using everyday language.",
  "detailed": "Provide thorough and comprehensive responses, covering all aspects of the topic.",
  "analytical": "Provide logical and critical responses, analyzing the topic in depth.",
  "assertive": "Provide confident and strong responses, taking a clear stance."
} 